{"keras_version": "2.0.3", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "dtype": "float32", "strides": [1, 1], "batch_input_shape": [null, 1, 48, 48], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1], "filters": 32, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "kernel_size": [3, 3], "data_format": "channels_last", "name": "conv2d_1", "padding": "same"}}, {"class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_1"}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "trainable": true, "strides": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1], "filters": 32, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "kernel_constraint": null, "data_format": "channels_last", "name": "conv2d_2", "padding": "same"}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "trainable": true, "strides": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1], "filters": 32, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "kernel_constraint": null, "data_format": "channels_last", "name": "conv2d_3", "padding": "same"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "padding": "valid", "strides": [2, 2], "data_format": "channels_first", "name": "max_pooling2d_1", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "trainable": true, "strides": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1], "filters": 64, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "kernel_constraint": null, "data_format": "channels_last", "name": "conv2d_4", "padding": "same"}}, {"class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_2"}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "trainable": true, "strides": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1], "filters": 64, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "kernel_constraint": null, "data_format": "channels_last", "name": "conv2d_5", "padding": "same"}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "trainable": true, "strides": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1], "filters": 64, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "kernel_constraint": null, "data_format": "channels_last", "name": "conv2d_6", "padding": "same"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "padding": "valid", "strides": [2, 2], "data_format": "channels_first", "name": "max_pooling2d_2", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "trainable": true, "strides": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1], "filters": 128, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "kernel_constraint": null, "data_format": "channels_last", "name": "conv2d_7", "padding": "same"}}, {"class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_3"}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "trainable": true, "strides": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1], "filters": 128, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "kernel_constraint": null, "data_format": "channels_last", "name": "conv2d_8", "padding": "same"}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "trainable": true, "strides": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1], "filters": 128, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "kernel_constraint": null, "data_format": "channels_last", "name": "conv2d_9", "padding": "same"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "padding": "valid", "strides": [2, 2], "data_format": "channels_first", "name": "max_pooling2d_3", "pool_size": [2, 2]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_4"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "bias_constraint": null, "units": 1024, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "activity_regularizer": null, "name": "dense_1"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "bias_constraint": null, "units": 512, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "activity_regularizer": null, "name": "dense_2"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "bias_constraint": null, "units": 6, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "activity_regularizer": null, "name": "dense_3"}}], "backend": "tensorflow"}