{"config": [{"config": {"dilation_rate": [1, 1], "kernel_size": [3, 3], "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "name": "conv2d_1", "batch_input_shape": [null, 1, 48, 48], "trainable": true, "filters": 32, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "kernel_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "padding": "same", "strides": [1, 1], "use_bias": true}, "class_name": "Conv2D"}, {"config": {"name": "dropout_1", "rate": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "name": "conv2d_2", "padding": "same", "trainable": true, "filters": 32, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "kernel_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "strides": [1, 1], "use_bias": true}, "class_name": "Conv2D"}, {"config": {"dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "name": "conv2d_3", "padding": "same", "trainable": true, "filters": 32, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "kernel_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "strides": [1, 1], "use_bias": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "max_pooling2d_1", "padding": "valid", "pool_size": [2, 2], "data_format": "channels_first", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "name": "conv2d_4", "padding": "same", "trainable": true, "filters": 64, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "kernel_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "strides": [1, 1], "use_bias": true}, "class_name": "Conv2D"}, {"config": {"name": "dropout_2", "rate": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "name": "conv2d_5", "padding": "same", "trainable": true, "filters": 64, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "kernel_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "strides": [1, 1], "use_bias": true}, "class_name": "Conv2D"}, {"config": {"dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "name": "conv2d_6", "padding": "same", "trainable": true, "filters": 64, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "kernel_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "strides": [1, 1], "use_bias": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "max_pooling2d_2", "padding": "valid", "pool_size": [2, 2], "data_format": "channels_first", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "name": "conv2d_7", "padding": "same", "trainable": true, "filters": 128, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "kernel_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "strides": [1, 1], "use_bias": true}, "class_name": "Conv2D"}, {"config": {"name": "dropout_3", "rate": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "name": "conv2d_8", "padding": "same", "trainable": true, "filters": 128, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "kernel_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "strides": [1, 1], "use_bias": true}, "class_name": "Conv2D"}, {"config": {"dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "name": "conv2d_9", "padding": "same", "trainable": true, "filters": 128, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "kernel_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "strides": [1, 1], "use_bias": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "max_pooling2d_3", "padding": "valid", "pool_size": [2, 2], "data_format": "channels_first", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dropout_4", "rate": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "name": "dense_1", "units": 1024, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"config": {"max_value": 3, "axis": 0}, "class_name": "MaxNorm"}, "use_bias": true}, "class_name": "Dense"}, {"config": {"name": "dropout_5", "rate": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "name": "dense_2", "units": 512, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"config": {"max_value": 3, "axis": 0}, "class_name": "MaxNorm"}, "use_bias": true}, "class_name": "Dense"}, {"config": {"name": "dropout_6", "rate": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "name": "dense_3", "units": 6, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "softmax", "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true}, "class_name": "Dense"}], "keras_version": "2.0.4", "class_name": "Sequential", "backend": "tensorflow"}